###############################################################################
# Created by write_sdc
# Thu Jun 26 16:41:32 2025
###############################################################################
current_design lfsr_axi_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_araddr[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_araddr[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_araddr[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_araddr[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_arvalid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_awaddr[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_awaddr[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_awaddr[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_awaddr[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_awvalid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_bready}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rready}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wdata[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wdata[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wdata[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wdata[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wdata[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wdata[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wdata[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wdata[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wvalid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_arready}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_awready}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_bresp[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_bresp[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_bvalid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rdata[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rdata[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rdata[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rdata[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rdata[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rdata[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rdata[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rdata[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_rvalid}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {s_axi_wready}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {s_axi_arready}]
set_load -pin_load 0.0334 [get_ports {s_axi_awready}]
set_load -pin_load 0.0334 [get_ports {s_axi_bvalid}]
set_load -pin_load 0.0334 [get_ports {s_axi_rvalid}]
set_load -pin_load 0.0334 [get_ports {s_axi_wready}]
set_load -pin_load 0.0334 [get_ports {s_axi_bresp[1]}]
set_load -pin_load 0.0334 [get_ports {s_axi_bresp[0]}]
set_load -pin_load 0.0334 [get_ports {s_axi_rdata[7]}]
set_load -pin_load 0.0334 [get_ports {s_axi_rdata[6]}]
set_load -pin_load 0.0334 [get_ports {s_axi_rdata[5]}]
set_load -pin_load 0.0334 [get_ports {s_axi_rdata[4]}]
set_load -pin_load 0.0334 [get_ports {s_axi_rdata[3]}]
set_load -pin_load 0.0334 [get_ports {s_axi_rdata[2]}]
set_load -pin_load 0.0334 [get_ports {s_axi_rdata[1]}]
set_load -pin_load 0.0334 [get_ports {s_axi_rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_arvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_awvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_bready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_rready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wvalid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_araddr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_araddr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_araddr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_araddr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_awaddr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_awaddr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_awaddr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_awaddr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {s_axi_wdata[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
